In [1]:
import numpy as np
import pandas as pd

## Series

In [2]:
pd.Series([36,22,26,24,25,26,50,55,60])

0    36
1    22
2    26
3    24
4    25
5    26
6    50
7    55
8    60
dtype: int64

In [3]:
pd.Series(
    [36,22,26,24,25,26,50,55,60],
    name = 'Age'
         
         )

0    36
1    22
2    26
3    24
4    25
5    26
6    50
7    55
8    60
Name: Age, dtype: int64

In [4]:
pd.Series(
       [36,22,26,24,25,26,50,55,60],
       name = 'Age',
       index = ['a','b','c','d','e','f','g','h','i']
      )

a    36
b    22
c    26
d    24
e    25
f    26
g    50
h    55
i    60
Name: Age, dtype: int64

## DataFrame

In [5]:
pd.DataFrame(
   
    {
        'name': ['a','b','c','d','e','f','g','h','i'],
        'age' : [36 ,22, 26, 24, 25, 26, 50, 55, 60]
    }
 
 )

  name  age
0    a   36
1    b   22
2    c   26
3    d   24
4    e   25
5    f   26
6    g   50
7    h   55
8    i   60

 ## Saving DataFrame

In [6]:
df = pd.DataFrame(
   
    {
        'name': ['a','b','c','d','e','f','g','h','i'],
         'age' : [36 ,22, 26, 24, 25, 26, 50, 55, 60]
    }
 
 )
df

  name  age
0    a   36
1    b   22
2    c   26
3    d   24
4    e   25
5    f   26
6    g   50
7    h   55
8    i   60

In [7]:
df.to_clipboard()

In [8]:
df.to_csv('student.csv')  ## csv file e save hobe

In [9]:
df.to_json('student.json') ## json file e save hobe

In [10]:
df.to_html('student.html') ## html table e save hobe

In [11]:
df.to_excel('student.xlsx') ## excel file e save hobe if error "pip install openpyxl"

In [12]:
df.to_excel('student.xlsx',sheet_name='A')

In [13]:
df.to_html('student.xml')

### Save in Sqlite3

In [14]:
import sqlite3
with sqlite3.connect('Test.sqlite3') as conn:
    df.to_sql('student',conn)

# Read the Data

In [15]:
pd.read_clipboard()

  name  age
0    a   36
1    b   22
2    c   26
3    d   24
4    e   25
5    f   26
6    g   50
7    h   55
8    i   60

In [16]:
pd.read_csv('student.csv',index_col='Unnamed: 0')

  name  age
0    a   36
1    b   22
2    c   26
3    d   24
4    e   25
5    f   26
6    g   50
7    h   55
8    i   60

In [17]:
pd.read_json('student.json')

  name  age
0    a   36
1    b   22
2    c   26
3    d   24
4    e   25
5    f   26
6    g   50
7    h   55
8    i   60

In [18]:
pd.read_html('student.html',index_col='Unnamed: 0')

[  name  age
 0    a   36
 1    b   22
 2    c   26
 3    d   24
 4    e   25
 5    f   26
 6    g   50
 7    h   55
 8    i   60]

In [19]:
pd.read_excel('student.xlsx',index_col='Unnamed: 0')

  name  age
0    a   36
1    b   22
2    c   26
3    d   24
4    e   25
5    f   26
6    g   50
7    h   55
8    i   60

### From Sqlite3

In [20]:
with sqlite3.connect('Test.sqlite3') as conn:
    df= pd.read_sql("""SELECT name,age FROM student""",conn)

In [21]:
df

  name  age
0    a   36
1    b   22
2    c   26
3    d   24
4    e   25
5    f   26
6    g   50
7    h   55
8    i   60

In [22]:
with sqlite3.connect('Test.sqlite3') as conn:
    df= pd.read_sql("""SELECT name FROM student""",conn)

In [23]:
df

  name
0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i